reports/033-haskell.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 1.209ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.220ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.218ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms    1.53ms  50.56ms   99.52%
    Req/Sec     3.52k   376.08    13.56k    91.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.17ms
 75.000%    1.66ms
 90.000%    2.03ms
 99.000%    2.61ms
 99.900%   29.90ms
 99.990%   46.91ms
 99.999%   50.11ms
100.000%   50.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.085     0.000000            1         1.00
       0.501     0.100000        50023         1.11
       0.679     0.200000       100139         1.25
       0.836     0.300000       149872         1.43
       0.995     0.400000       200060         1.67
       1.167     0.500000       249960         2.00
       1.259     0.550000       274711         2.22
       1.355     0.600000       299895         2.50
       1.453     0.650000       324769         2.86
       1.554     0.700000       349714         3.33
       1.657     0.750000       374797         4.00
       1.711     0.775000       387184         4.44
       1.767     0.800000       399530         5.00
       1.826     0.825000       412131         5.71
       1.888     0.850000       424502         6.67
       1.955     0.875000       437009         8.00
       1.992     0.887500       443306         8.89
       2.031     0.900000       449463        10.00
       2.073     0.912500       455726        11.43
       2.119     0.925000       462169        13.33
       2.169     0.937500       468232        16.00
       2.197     0.943750       471343        17.78
       2.227     0.950000       474461        20.00
       2.261     0.956250       477581        22.86
       2.299     0.962500       480676        26.67
       2.343     0.968750       483816        32.00
       2.369     0.971875       485459        35.56
       2.395     0.975000       486977        40.00
       2.425     0.978125       488545        45.71
       2.459     0.981250       490033        53.33
       2.501     0.984375       491606        64.00
       2.525     0.985938       492398        71.11
       2.551     0.987500       493148        80.00
       2.583     0.989062       493954        91.43
       2.621     0.990625       494745       106.67
       2.667     0.992188       495507       128.00
       2.695     0.992969       495889       142.22
       2.727     0.993750       496283       160.00
       2.769     0.994531       496665       182.86
       2.843     0.995313       497059       213.33
       2.983     0.996094       497441       256.00
       3.483     0.996484       497634       284.44
       6.915     0.996875       497829       320.00
       9.743     0.997266       498025       365.71
      12.535     0.997656       498219       426.67
      15.871     0.998047       498414       512.00
      17.791     0.998242       498513       568.89
      19.679     0.998437       498609       640.00
      22.911     0.998633       498707       731.43
      26.703     0.998828       498804       853.33
      30.271     0.999023       498902      1024.00
      32.287     0.999121       498952      1137.78
      34.079     0.999219       498999      1280.00
      35.775     0.999316       499049      1462.86
      37.663     0.999414       499097      1706.67
      39.455     0.999512       499146      2048.00
      40.383     0.999561       499171      2275.56
      41.247     0.999609       499194      2560.00
      42.143     0.999658       499219      2925.71
      43.071     0.999707       499244      3413.33
      44.031     0.999756       499268      4096.00
      44.511     0.999780       499281      4551.11
      44.927     0.999805       499293      5120.00
      45.279     0.999829       499304      5851.43
      45.695     0.999854       499316      6826.67
      46.431     0.999878       499329      8192.00
      46.623     0.999890       499335      9102.22
      46.975     0.999902       499341     10240.00
      47.263     0.999915       499347     11702.86
      47.519     0.999927       499354     13653.33
      47.775     0.999939       499359     16384.00
      47.903     0.999945       499362     18204.44
      48.095     0.999951       499366     20480.00
      48.287     0.999957       499368     23405.71
      48.607     0.999963       499371     27306.67
      49.087     0.999969       499374     32768.00
      49.439     0.999973       499376     36408.89
      49.759     0.999976       499377     40960.00
      49.855     0.999979       499379     46811.43
      49.887     0.999982       499380     54613.33
      50.079     0.999985       499382     65536.00
      50.111     0.999986       499384     72817.78
      50.111     0.999988       499384     81920.00
      50.111     0.999989       499384     93622.86
      50.175     0.999991       499385    109226.67
      50.239     0.999992       499386    131072.00
      50.239     0.999993       499386    145635.56
      50.239     0.999994       499386    163840.00
      50.367     0.999995       499387    187245.71
      50.367     0.999995       499387    218453.33
      50.495     0.999996       499388    262144.00
      50.495     0.999997       499388    291271.11
      50.495     0.999997       499388    327680.00
      50.495     0.999997       499388    374491.43
      50.495     0.999998       499388    436906.67
      50.591     0.999998       499389    524288.00
      50.591     1.000000       499389          inf
#[Mean    =        1.292, StdDeviation   =        1.533]
#[Max     =       50.560, Total count    =       499389]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599685 requests in 1.00m, 68.06MB read
Requests/sec:   9994.79
Transfer/sec:      1.13MB