reports/033-haskell.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 1.509ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.512ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.505ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.41ms    3.30ms  89.15ms   99.37%
    Req/Sec     3.52k   491.82    16.11k    95.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.15ms
 75.000%    1.61ms
 90.000%    1.96ms
 99.000%    2.62ms
 99.900%   56.90ms
 99.990%   85.18ms
 99.999%   88.77ms
100.000%   89.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.088     0.000000            1         1.00
       0.493     0.100000        50120         1.11
       0.666     0.200000       100165         1.25
       0.818     0.300000       149833         1.43
       0.975     0.400000       199923         1.67
       1.148     0.500000       249796         2.00
       1.239     0.550000       274930         2.22
       1.331     0.600000       299671         2.50
       1.423     0.650000       324638         2.86
       1.518     0.700000       349768         3.33
       1.613     0.750000       374702         4.00
       1.662     0.775000       387048         4.44
       1.713     0.800000       399541         5.00
       1.766     0.825000       412016         5.71
       1.823     0.850000       424500         6.67
       1.886     0.875000       437083         8.00
       1.920     0.887500       443384         8.89
       1.956     0.900000       449552        10.00
       1.995     0.912500       455719        11.43
       2.040     0.925000       461967        13.33
       2.091     0.937500       468210        16.00
       2.121     0.943750       471479        17.78
       2.153     0.950000       474605        20.00
       2.187     0.956250       477677        22.86
       2.227     0.962500       480812        26.67
       2.273     0.968750       483910        32.00
       2.299     0.971875       485417        35.56
       2.329     0.975000       486942        40.00
       2.363     0.978125       488536        45.71
       2.405     0.981250       490100        53.33
       2.455     0.984375       491643        64.00
       2.487     0.985938       492426        71.11
       2.525     0.987500       493185        80.00
       2.577     0.989062       493956        91.43
       2.645     0.990625       494722       106.67
       2.767     0.992188       495508       128.00
       2.905     0.992969       495891       142.22
       5.371     0.993750       496281       160.00
      12.799     0.994531       496671       182.86
      20.255     0.995313       497062       213.33
      27.663     0.996094       497452       256.00
      31.215     0.996484       497648       284.44
      34.623     0.996875       497843       320.00
      37.631     0.997266       498037       365.71
      40.607     0.997656       498234       426.67
      43.519     0.998047       498428       512.00
      45.375     0.998242       498530       568.89
      47.231     0.998437       498622       640.00
      49.855     0.998633       498721       731.43
      53.247     0.998828       498819       853.33
      57.919     0.999023       498916      1024.00
      61.343     0.999121       498964      1137.78
      64.735     0.999219       499012      1280.00
      68.799     0.999316       499061      1462.86
      72.319     0.999414       499110      1706.67
      76.415     0.999512       499160      2048.00
      78.207     0.999561       499184      2275.56
      79.231     0.999609       499209      2560.00
      80.319     0.999658       499232      2925.71
      81.215     0.999707       499256      3413.33
      81.983     0.999756       499282      4096.00
      82.431     0.999780       499293      4551.11
      83.135     0.999805       499305      5120.00
      83.519     0.999829       499317      5851.43
      83.903     0.999854       499329      6826.67
      84.607     0.999878       499342      8192.00
      84.799     0.999890       499349      9102.22
      85.311     0.999902       499355     10240.00
      85.695     0.999915       499362     11702.86
      85.951     0.999927       499366     13653.33
      86.271     0.999939       499373     16384.00
      86.399     0.999945       499376     18204.44
      86.591     0.999951       499378     20480.00
      86.911     0.999957       499381     23405.71
      87.359     0.999963       499384     27306.67
      87.551     0.999969       499388     32768.00
      87.615     0.999973       499389     36408.89
      87.679     0.999976       499390     40960.00
      87.999     0.999979       499392     46811.43
      88.063     0.999982       499393     54613.33
      88.319     0.999985       499395     65536.00
      88.511     0.999986       499396     72817.78
      88.511     0.999988       499396     81920.00
      88.767     0.999989       499398     93622.86
      88.767     0.999991       499398    109226.67
      88.895     0.999992       499399    131072.00
      88.895     0.999993       499399    145635.56
      88.895     0.999994       499399    163840.00
      89.023     0.999995       499400    187245.71
      89.023     0.999995       499400    218453.33
      89.151     0.999996       499401    262144.00
      89.151     0.999997       499401    291271.11
      89.151     0.999997       499401    327680.00
      89.151     0.999997       499401    374491.43
      89.151     0.999998       499401    436906.67
      89.215     0.999998       499402    524288.00
      89.215     1.000000       499402          inf
#[Mean    =        1.410, StdDeviation   =        3.299]
#[Max     =       89.152, Total count    =       499402]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599696 requests in 1.00m, 68.06MB read
Requests/sec:   9994.62
Transfer/sec:      1.13MB